In [3]:
import pandas as pd

# Create sample data (with 20 duplicates)
data = [
    [1, "Alice", "New York", 25],
    [2, "Bob", "Los Angeles", 30],
    [3, "Charlie", "Chicago", 35],
    [4, "David", "Houston", 28],
    [5, "Eva", "Phoenix", 22],
    [6, "Frank", "Philadelphia", 33],
    [7, "Grace", "San Antonio", 27],
    [8, "Hannah", "San Diego", 24],
    [9, "Ivan", "Dallas", 31],
    [10, "Jane", "San Jose", 29],
    
    # duplicates start here
    [1, "Alice", "New York", 25],
    [2, "Bob", "Los Angeles", 30],
    [3, "Charlie", "Chicago", 35],
    [4, "David", "Houston", 28],
    [5, "Eva", "Phoenix", 22],
    [6, "Frank", "Philadelphia", 33],
    [7, "Grace", "San Antonio", 27],
    [8, "Hannah", "San Diego", 24],
    [9, "Ivan", "Dallas", 31],
    [10, "Jane", "San Jose", 29],

    # unique new entries
    [11, "Kathy", "Austin", 26],
    [12, "Leo", "Jacksonville", 32],
    [13, "Mike", "Fort Worth", 29],
    [14, "Nina", "Columbus", 34],
    [15, "Oscar", "Charlotte", 23],
    [16, "Pam", "Indianapolis", 36],
    [17, "Quinn", "San Francisco", 28],
    [18, "Rachel", "Seattle", 27],
    [19, "Sam", "Denver", 31],
    [20, "Tina", "Washington", 30],

    # additional duplicates
    [11, "Kathy", "Austin", 26],
    [12, "Leo", "Jacksonville", 32],
    [13, "Mike", "Fort Worth", 29],
    [14, "Nina", "Columbus", 34],
    [15, "Oscar", "Charlotte", 23],
    [16, "Pam", "Indianapolis", 36],
    [17, "Quinn", "San Francisco", 28],
    [18, "Rachel", "Seattle", 27],
    [19, "Sam", "Denver", 31],
    [20, "Tina", "Washington", 30]
]

# Create DataFrame
df = pd.DataFrame(data, columns=["ID", "Name", "City", "Age"])

In [2]:
df.info

<bound method DataFrame.info of     ID     Name           City  Age
0    1    Alice       New York   25
1    2      Bob    Los Angeles   30
2    3  Charlie        Chicago   35
3    4    David        Houston   28
4    5      Eva        Phoenix   22
5    6    Frank   Philadelphia   33
6    7    Grace    San Antonio   27
7    8   Hannah      San Diego   24
8    9     Ivan         Dallas   31
9   10     Jane       San Jose   29
10   1    Alice       New York   25
11   2      Bob    Los Angeles   30
12   3  Charlie        Chicago   35
13   4    David        Houston   28
14   5      Eva        Phoenix   22
15   6    Frank   Philadelphia   33
16   7    Grace    San Antonio   27
17   8   Hannah      San Diego   24
18   9     Ivan         Dallas   31
19  10     Jane       San Jose   29
20  11    Kathy         Austin   26
21  12      Leo   Jacksonville   32
22  13     Mike     Fort Worth   29
23  14     Nina       Columbus   34
24  15    Oscar      Charlotte   23
25  16      Pam   Indianapolis   36
26  17    Quinn  San Francisco   28
27  18   Rachel        Seattle   27
28  19      Sam         Denver   31
29  20     Tina     Washington   30
30  11    Kathy         Austin   26
31  12      Leo   Jacksonville   32
32  13     Mike     Fort Worth   29
33  14     Nina       Columbus   34
34  15    Oscar      Charlotte   23
35  16      Pam   Indianapolis   36
36  17    Quinn  San Francisco   28
37  18   Rachel        Seattle   27
38  19      Sam         Denver   31
39  20     Tina     Washington   30>

In [4]:
#Finding duplicate values
duplicates = df[df.duplicated()]
print(duplicates)

    ID     Name           City  Age
10   1    Alice       New York   25
11   2      Bob    Los Angeles   30
12   3  Charlie        Chicago   35
13   4    David        Houston   28
14   5      Eva        Phoenix   22
15   6    Frank   Philadelphia   33
16   7    Grace    San Antonio   27
17   8   Hannah      San Diego   24
18   9     Ivan         Dallas   31
19  10     Jane       San Jose   29
30  11    Kathy         Austin   26
31  12      Leo   Jacksonville   32
32  13     Mike     Fort Worth   29
33  14     Nina       Columbus   34
34  15    Oscar      Charlotte   23
35  16      Pam   Indianapolis   36
36  17    Quinn  San Francisco   28
37  18   Rachel        Seattle   27
38  19      Sam         Denver   31
39  20     Tina     Washington   30

In [5]:
# Remove duplicates (keeping first occurrence)
df_cleaned = df.drop_duplicates()
print("\nDataset After Removing Duplicates:\n", df_cleaned)

Dataset After Removing Duplicates:
     ID     Name           City  Age
0    1    Alice       New York   25
1    2      Bob    Los Angeles   30
2    3  Charlie        Chicago   35
3    4    David        Houston   28
4    5      Eva        Phoenix   22
5    6    Frank   Philadelphia   33
6    7    Grace    San Antonio   27
7    8   Hannah      San Diego   24
8    9     Ivan         Dallas   31
9   10     Jane       San Jose   29
20  11    Kathy         Austin   26
21  12      Leo   Jacksonville   32
22  13     Mike     Fort Worth   29
23  14     Nina       Columbus   34
24  15    Oscar      Charlotte   23
25  16      Pam   Indianapolis   36
26  17    Quinn  San Francisco   28
27  18   Rachel        Seattle   27
28  19      Sam         Denver   31
29  20     Tina     Washington   30

In [ ]:
# So now, duplicate values have been removed